# Browser Organization Get Sorting Parameter Id Path Method

Source: https://www.revitapidocs.com/2026/fc632868-4931-1c5e-2603-37a9b17e0b6c.htm

---

| Browser Organization Get Sorting Parameter Id Path Method |
| --- |

The parameter Id path used to determine the sorting order of items in the browser.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IList<ElementId> GetSortingParameterIdPath()
```

```
Public Function GetSortingParameterIdPath As IList(Of ElementId)
```

```
public:
IList<ElementId^>^ GetSortingParameterIdPath()
```

```
member GetSortingParameterIdPath : unit -> IList<ElementId>
```

#### Return Value

IList ElementId Remarks A parameter Id path consists of reference parameter Id(s) {0\...n} \+ paramId,
 and the value of the last parameter in the path is the one that is used to determine the sorting order of items in the browser.
 Reference parameter is ElementId valued parameter used to retrieve related element, its parameter value is the related element Id.
 Given an Element, get the value of reference parameter and use the ElementId value to retrieve the referenced element.
 Each paramId in the path except for the last one is a reference parameter pointing to the next element.
 Recursively get next element through element obtained in the previous round with the next paramId in the path,
 finally get the value of the last parameter. See Also

#### Reference

BrowserOrganization Class Autodesk.Revit.DB Namespace